import 'newModelQuizz.dart';

List<NewModelQuizz> providerQuation = [
  NewModelQuizz({
    1: "من هو راهب آل محمد؟"
  }, {
    "موسى الكاظم": true,
    "علي بن موسى الرضا": false,
    " محمد الجواد": false,
  }),
  NewModelQuizz({
    2: "من هو صاحب السجدة الطويلة؟ "
  }, {
    "الإمام السجاد": false,
    "الإمام الباقر": false,
    " الإمام موسى بن جعفر الكاظم": true,
  }),
  NewModelQuizz({
    1: "كم سنة ضل يتنقل الإمام الكاظم بين السجون؟"
  }, {
    "١٧": false,
    "١٨": true,
    "١٦": false,
  }),
  NewModelQuizz({
    2: "في أي مكان وضعت جنازة الإمام الكاظم (ع) عند لقاءه بشيعته؟ "
  }, {
    "جسر الأعظمية": true,
    "في السوق": false,
    "داخل القصر": false,
  }),
  NewModelQuizz({
    1: "أيّ إمام دفن مع الإمام الكاظم (ع) ؟ "
  }, {
    "الإمام الباقر (ع)": false,
    "الإمام الحسن العسكري (ع)": false,
    "الإمام الجواد (ع) ": true,
  }),
  NewModelQuizz({
    2: " بماذا لقب الإمام الكاظم عليه السلام؟ "
  }, {
    "حليف السجدة الطويلة ": true,
    "غريب طوس": false,
    " أسير الكربات ": false,
  }),
  NewModelQuizz({
    1: "من هي أم الإمام الكاظم (ع) ؟ "
  }, {
    "حميدة خاتون": true,
    "نرجس ": false,
    " فضة ": false,
  }),
  NewModelQuizz({
    2: "أين دفن الإمام الكاظم (ع)"
  }, {
    "في النجف": false,
    "في بغداد": true,
    "في سامراء": false,
  }),
];
